app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("image_url", "user_id", "created_at", "updated_at", "caption", "image") VALUES (?, ?, ?, ?, ?, ?)  [["image_url", ""], ["user_id", 1], ["created_at", "2018-03-28 05:54:51.682547"], ["updated_at", "2018-03-28 05:54:51.682547"], ["caption", "Jennifer"], ["image", "z9qknh0tp5ooc7akla2w.jpg"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "caption" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["caption", "cat"], ["updated_at", "2018-03-27 04:14:11.924215"], ["id", 1]]